#include<interrupt.h>

void interrupt()
{

/*	   对IE寄存器进行操作			*/
/*	   EA/-/ET2/ES/ET1/EX1/ET0/EX0			*/


	EA=1;   		//开总中断

	EX0=1;			//允许外部中断0  INT0
	EX1=1;		    //允许外部中断1  INT1
	ET0=1;			//允许T0中断     定时器/计数器T0溢出中断允许控制位
	ET1=1;		  	//允许T1中断     定时器/计数器T1溢出中断允许控制位
	ET2=1;		 	//允许T2中断     定时器/计数器T2溢出中断允许控制位
	ES=1;			//串行口中断     串行口钟铉允许控制位

}

/*			对TCON寄存器进行操作	   */
/*			RF1/TR1/TF0/TR0/IE1/IT1/IE0/IT0		*/

//TF1=0,<T0有溢出中断请求>
//TF1=1,<T1有溢出中断请求>


/*			IP寄存器操作，设置优先级			*/
/*80C52增加了1位，T2定时器/计数器的中断优先权定义位*/
void InitPriority()
{
	PX0=1;	     // INT0
	PT0=1;	     // T0
	PX1=1;		 // INT1
	PT1=1;		 //	T1
	PS=1;		 //	串行接口
}


/*		串行接口控制寄存器			*/
/*	SM0/SM1/SM2/REN/TB8/RB8/TI/RI	*/
void InitSerial()
{
//RI=0;    // 串口一帧数据接收完毕中断标志位，硬件置1，需要软件清除
//TI=0     // 串口一帧数据发送完毕中断标志位，硬件置1，需要软件清除


return 0;
}




/*	   定时器/计数器方式选择		*/
//void IniTimer()	 /*	   定时器/计数器方式选择		*/
//{
///*TMOD      定时器/计数器方式设定*/
///*GATE/CT/M1|M0/"T1"*//*"T0"/GATE/CT/M1|M0*/
///*
//GATE=0,定时器；GATE=1，计数器
//CT=0，定时器；CT=1，计数器
//*/

//}


void InitTimer()
{
	TMOD=0X21;      //定时器0，方式1
	TH0=*****;       //高位
	TL0=****;		 //低位
	EA=1;            //开总中断
	ET0=1;           //定时器0使能
//启动定时器！！
	TR0=1;           //定时器启动，至于所有初始化之后能增强系统稳定性
}


void InitCounter()
{
	TMOD=0X21;
	TH0=*****;
	TL0=*****;
	EA=1;
	ET0=1	
}




